src/ex_Tabakon/InformationRegisters/ПрименениеСистемНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПрименениеСистемНалогообложения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Enums/ТипыСистемНалогообложенияККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыСистемНалогообложенияККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УСНДоходРасход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСНДоходРасход5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСНДоходРасход7</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ПрименениеСистемНалогообложения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
&Вместо("ЗаполнитьСНО")
Процедура ТБКЗаполнитьСНО()
	Если ЗначениеЗаполнено(Запись.СистемаНалогообложения) Тогда
		Если Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
			СистемаНалогообложенияСтрока 	= "УСН";
			УСНОбъектНалогообложения 		= "Доход";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
			СистемаНалогообложенияСтрока	= "УСН";
			УСНОбъектНалогообложения 		= Нстр("ru='Доход минус расход'");
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда
			СистемаНалогообложенияСтрока 	= "Общая";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
			СистемаНалогообложенияСтрока 	= "ЕНВД";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
			СистемаНалогообложенияСтрока 	= "Патент";	
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
			СистемаНалогообложенияСтрока 	= "ЕСН";
			//Марк 2025-02-13
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход5 Тогда
			СистемаНалогообложенияСтрока 	= "УСНДоходРасход5";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход7 Тогда
			СистемаНалогообложенияСтрока 	= "УСНДоходРасход7";	
			//КонецМарк	
		КонецЕсли;
	КонецЕсли;
	
	Элементы.УСНОбъектНалогообложения.Видимость = СистемаНалогообложенияСтрока = "УСН";

КонецПроцедуры

&НаКлиенте
&Вместо("УстановитьСНОВЗаписи")
Процедура ТБКУстановитьСНОВЗаписи() 
	
	Если СистемаНалогообложенияСтрока = "УСН" И УСНОбъектНалогообложения = "Доход" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоход");
	ИначеЕсли СистемаНалогообложенияСтрока = "УСН" И УСНОбъектНалогообложения = Нстр("ru='Доход минус расход'") Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "Общая" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "ЕНВД" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ЕНВД"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "Патент" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.Патент"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "ЕСН"Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ЕСН");
		//Марк 2025-02-13
	ИначеЕсли СистемаНалогообложенияСтрока = "УСНДоходРасход5" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход5");
		ИначеЕсли СистемаНалогообложенияСтрока = "УСНДоходРасход7" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход7");
		//КонецМарк
	Иначе
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&Вместо("СистемаНалогообложенияПриИзменении")
Процедура ТБКСистемаНалогообложенияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	ПроверитьПереходСЕНВД();
	
	УстановитьСНОВЗаписи();
	
	Если СистемаНалогообложенияСтрока <> "Общая" И СистемаНалогообложенияСтрока <> "ЕСН" Тогда
		Запись.ОсвобожденОтНДС = Истина;
	КонецЕсли; 
	
	//Марк 2025-02-21
	Если СистемаНалогообложенияСтрока = "УСНДоходРасход5" или СистемаНалогообложенияСтрока = "УСНДоходРасход7" Тогда
		Запись.ОсвобожденОтНДС = Ложь;	
	КонецЕсли;
	//КонецМарк
	
	УстановитьДоступностьЭлементов();

	
КонецПроцедуры
